{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": "(\\[|\\]|Br?|Cl?|Si?|Se?|se?|@@?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\|\\/|:|~|@|\\?|>|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[BOS]": {
        "id": "[BOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[BOS]"
        ]
      },
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          3
        ],
        "tokens": [
          "[EOS]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[PAD]": 0,
      "[MASK]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "#": 4,
      "(": 5,
      ")": 6,
      "+": 7,
      "-": 8,
      "/": 9,
      "1": 10,
      "2": 11,
      "3": 12,
      "4": 13,
      "5": 14,
      "6": 15,
      "7": 16,
      "8": 17,
      "=": 18,
      "@": 19,
      "B": 20,
      "C": 21,
      "F": 22,
      "H": 23,
      "I": 24,
      "N": 25,
      "O": 26,
      "P": 27,
      "S": 28,
      "[": 29,
      "\\": 30,
      "]": 31,
      "c": 32,
      "l": 33,
      "n": 34,
      "o": 35,
      "r": 36,
      "s": 37,
      "cc": 38,
      "CC": 39,
      "c1": 40,
      "O)": 41,
      "(C": 42,
      "=O)": 43,
      "(=O)": 44,
      "H]": 45,
      "c2": 46,
      "[C": 47,
      "[C@": 48,
      "c1cc": 49,
      "(C)": 50,
      "C(=O)": 51,
      "c(": 52,
      "[C@@": 53,
      "[C@@H]": 54,
      "[C@H]": 55,
      "c2cc": 56,
      ")cc": 57,
      "c3": 58,
      "+]": 59,
      "CCC": 60,
      "[N": 61,
      "2)": 62,
      "NC(=O)": 63,
      "[NH": 64,
      "c1cccc": 65,
      "c(C": 66,
      "(=O)N": 67,
      "=C": 68,
      "1CC": 69,
      "F)": 70,
      ")cc1": 71,
      "CO": 72,
      "c1ccc(": 73,
      "c2cccc": 74,
      "n1": 75,
      "(C)C": 76,
      "c3cc": 77,
      "2CC": 78,
      "[NH+]": 79,
      "cn": 80,
      ")C": 81,
      "C(=O)N": 82,
      "CC1": 83,
      "c2ccccc2": 84,
      "c1n": 85,
      "c1ccccc1": 86,
      "OC": 87,
      "(N": 88,
      "(F)": 89,
      "O=C": 90,
      "-]": 91,
      "C[C@H]": 92,
      "c(C)": 93,
      "C[C@@H]": 94,
      "[n": 95,
      "(CC": 96,
      "N(C": 97,
      "3)": 98,
      "[O": 99,
      "[O-]": 100,
      "S(=O)": 101,
      "C1": 102,
      "1CCC": 103,
      ")c1": 104,
      "Cc1cc": 105,
      "c3cccc": 106,
      "c2n": 107,
      "[nH]": 108,
      "c(Cl": 109,
      "CCO": 110,
      "2)cc1": 111,
      "2+]": 112,
      "[NH2+]": 113,
      ")N": 114,
      "1C": 115,
      "NC(=O)N": 116,
      "c4": 117,
      "c2ccc(": 118,
      "c3ccccc3": 119,
      "(=O)[O-]": 120,
      "F)cc": 121,
      ")n": 122,
      "S(=O)(=O)": 123,
      "cs": 124,
      "CC(C)": 125,
      "2C": 126,
      "CC(=O)N": 127,
      "/C": 128,
      "2CCC": 129,
      "(C(=O)N": 130,
      "CC2)": 131,
      "[C@@H](C)": 132,
      "(O)": 133,
      "Br": 134,
      "cccc": 135,
      "[C@H](C)": 136,
      "c(-": 137,
      "N(C(=O)": 138,
      "N(": 139,
      "NC(=O)C": 140,
      "[N+]": 141,
      "n2": 142,
      "cc1": 143,
      "Cc1ccc(": 144,
      "Cc1n": 145,
      "3CC": 146,
      "#N": 147,
      "O=C(N": 148,
      "[N+](=O)[O-]": 149,
      "c(=O)": 150,
      "c1ccc(C": 151,
      "(Cl": 152,
      "=O": 153,
      "2)c1": 154,
      "Cl": 155,
      "(F)(F)": 156,
      "[C@H](": 157,
      "CCN": 158,
      "(-": 159,
      "o1": 160,
      "c2)": 161,
      "[C@@H](": 162,
      ")C1": 163,
      "CN": 164,
      "c2c(": 165,
      "COc1ccc(": 166,
      "nn": 167,
      "c(N": 168,
      "=N": 169,
      "c1cccc(": 170,
      "c1)": 171,
      "[C@@H]1": 172,
      "1)": 173,
      "S(=O)(=O)N": 174,
      "Cc1": 175,
      "2)CC1": 176,
      "(C)C)": 177,
      "F)cc1": 178,
      "(N)": 179,
      "2)C1": 180,
      "[C@]": 181,
      "[C@H]1": 182,
      "c2ccccc2)": 183,
      "c(C(=O)N": 184,
      "3+]": 185,
      "[NH3+]": 186,
      "[C@@]": 187,
      "COc1cc": 188,
      "s1": 189,
      "c(Cl)cc": 190,
      "=C/": 191,
      "[C@H](C": 192,
      "[C@@H]1CC": 193,
      "O=C(C": 194,
      "[C@@H](C": 195,
      "COC(=O)": 196,
      "c1C": 197,
      "[C@H]1CC": 198,
      "O=C(": 199,
      "(F)(F)F)": 200,
      "[C@@H]2": 201,
      "#N)": 202,
      "c1ccc(Cl": 203,
      "CCCC": 204,
      "1C(=O)": 205,
      "OCC": 206,
      "C[C@H](": 207,
      "c3n": 208,
      "c1nn": 209,
      "cn1": 210,
      ")ccc1": 211,
      "[NH+](C": 212,
      "c2c1": 213,
      "C[C@@H](": 214,
      "H+]": 215,
      "C1CC": 216,
      "[nH+]": 217,
      ")CC": 218,
      "c4cccc": 219,
      "[C@H]2": 220,
      "CCC1": 221,
      ")c2": 222,
      "2=O)": 223,
      "n1cc": 224,
      "c3c(": 225,
      "[O-])": 226,
      "n3": 227,
      "N1CC": 228,
      "N2CC": 229,
      "c2c(c1)": 230,
      "=S": 231,
      "SC": 232,
      "3)n": 233,
      "c2ccc(F)cc": 234,
      "c(C)cc": 235,
      "2)n": 236,
      "c1ccc(F)cc1": 237,
      "c1cn": 238,
      "(C)(C)C": 239,
      "(CC(=O)N": 240,
      "c3ccc(": 241,
      "3)C": 242,
      "co": 243,
      "Cc1ccccc1": 244,
      "[C@@H]1CCC": 245,
      "ncc": 246,
      "OC)": 247,
      "cs1": 248,
      "c(F)": 249,
      "c1cccc(C": 250,
      "[C@@H]1C": 251,
      "/N": 252,
      "3)cc": 253,
      "/C(": 254,
      "C[NH+]": 255,
      "c2cn": 256,
      "=C(": 257,
      "2)n1": 258,
      "CS": 259,
      "c12": 260,
      "(N)=O)": 261,
      "O1": 262,
      "c4ccccc4": 263,
      "c1cc(": 264,
      "3C": 265,
      ")N1CC": 266,
      "[C@H]1CCC": 267,
      "c2ccccc21": 268,
      "c(C)c1": 269,
      "[C@@H]2CC": 270,
      "(C)C(=O)": 271,
      "[C@H](C)C": 272,
      "c2cc(": 273,
      "CC[NH+]": 274,
      "CCOC(=O)": 275,
      "/C=C/": 276,
      "c1ccc(Cl)cc1": 277,
      "(=O)=O)": 278,
      "CC(C)(C)": 279,
      "c1ccccc1)": 280,
      "[C@H]2CC": 281,
      "N2": 282,
      "3CCC": 283,
      "c[nH]": 284,
      "Br)": 285,
      "N#": 286,
      "NC(=O)C(=O)N": 287,
      "[C@H]1C": 288,
      "n(C)": 289,
      "C)": 290,
      "S(C)": 291,
      "c2ccc(Cl)cc": 292,
      "=CC": 293,
      "[C@@H](C)C": 294,
      "c1ccc2c(c1)": 295,
      "(CC)": 296,
      "C2CC": 297,
      "COc1ccc(C": 298,
      "COc1ccccc1": 299,
      "[NH+](C)C": 300,
      "C[C@H]1": 301,
      "c2nn": 302,
      "(Cl)": 303,
      "[C@@H]2C": 304,
      "Cc1cc(": 305,
      "C(=O)N1CC": 306,
      "(C)CC": 307,
      "c4cc": 308,
      "c1ccc(-": 309,
      "(C)cc": 310,
      "NC": 311,
      "OC(=O)": 312,
      "O=": 313,
      "C[C@@H]1": 314,
      "Cn1": 315,
      "c(NC(=O)": 316,
      "c3)": 317,
      "c(C)n": 318,
      "N(C(=O)N": 319,
      "cnc2": 320,
      "3)CC2)": 321,
      "c2ncc": 322,
      "[NH3+])": 323,
      "[C@]1": 324,
      "c(S": 325,
      "CC(=O)": 326,
      "[C@H](O)": 327,
      "c(Cl)": 328,
      "Cc1cccc": 329,
      "OCO": 330,
      "N1": 331,
      "CC1)": 332,
      ")ccc2": 333,
      "[C@@]1": 334,
      "cnc1": 335,
      "[S": 336,
      ")C1CC": 337,
      "S(C)(=O)=O)": 338,
      "c2ccc(C": 339,
      "4)": 340,
      "c1ncc": 341,
      "(=S": 342,
      "CCn1": 343,
      "(C#N)": 344,
      "[C@H]2C": 345,
      "c1ccn": 346,
      "[NH2+]C": 347,
      "c3ccccc3)": 348,
      "c(OC": 349,
      "[C@@H]2CCC": 350,
      "n2cc": 351,
      "3CCCC": 352,
      "Cl)": 353,
      "CCC(=O)N": 354,
      "[NH+]2CC": 355,
      "co1": 356,
      "Cc1ccc(C": 357,
      "[NH+]1CC": 358,
      "[N+](=O)[O-])": 359,
      "nc1": 360,
      "N1C(=O)": 361,
      "OCCO": 362,
      "CC(C)C": 363,
      "(C)=O)": 364,
      "(C(=O)": 365,
      "[C@H]2CCC": 366,
      "(Cl)c1": 367,
      "[C@@H](O)": 368,
      "n(-": 369,
      "c2cccc(": 370,
      "c2cccs": 371,
      "c2ccc3c(": 372,
      "(C)(C)": 373,
      "c(=O)[nH]": 374,
      "@]": 375,
      ")cc2": 376,
      "3)cc1": 377,
      "(=O)[O-])": 378,
      "C(=O)[O-]": 379,
      "CNC(=O)": 380,
      "C[C@@H](C)": 381,
      "CC2)cc1": 382,
      "=C\\": 383,
      "C[C@H](C)": 384,
      "O=C1": 385,
      "=N/": 386,
      "c2C": 387,
      "OCC1": 388,
      "=C2": 389,
      "c2s": 390,
      "c2ccc3c(c2)": 391,
      "c3ccc(F)cc": 392,
      "n1)": 393,
      "CC[NH2+]": 394,
      "C[C@H]1C": 395,
      "c(F)cc": 396,
      "c1cccc2": 397,
      "c(F)c1": 398,
      "c2ccco": 399
    },
    "merges": [
      "c c",
      "C C",
      "c 1",
      "O )",
      "( C",
      "= O)",
      "( =O)",
      "H ]",
      "c 2",
      "[ C",
      "[C @",
      "c1 cc",
      "(C )",
      "C (=O)",
      "c (",
      "[C@ @",
      "[C@@ H]",
      "[C@ H]",
      "c2 cc",
      ") cc",
      "c 3",
      "+ ]",
      "CC C",
      "[ N",
      "2 )",
      "N C(=O)",
      "[N H",
      "c1cc cc",
      "c (C",
      "(=O) N",
      "= C",
      "1 CC",
      "F )",
      ")cc 1",
      "C O",
      "c1cc c(",
      "c2cc cc",
      "n 1",
      "(C) C",
      "c3 cc",
      "2 CC",
      "[NH +]",
      "c n",
      ") C",
      "C(=O) N",
      "CC 1",
      "c2cccc c2",
      "c1 n",
      "c1cccc c1",
      "O C",
      "( N",
      "( F)",
      "O =C",
      "- ]",
      "C [C@H]",
      "c (C)",
      "C [C@@H]",
      "[ n",
      "( CC",
      "N (C",
      "3 )",
      "[ O",
      "[O -]",
      "S (=O)",
      "C 1",
      "1 CCC",
      ") c1",
      "C c1cc",
      "c3cc cc",
      "c2 n",
      "[n H]",
      "c(C l",
      "CC O",
      "2 )cc1",
      "2 +]",
      "[NH 2+]",
      ") N",
      "1 C",
      "NC(=O) N",
      "c 4",
      "c2cc c(",
      "c3cccc c3",
      "(=O) [O-]",
      "F )cc",
      ") n",
      "S(=O) (=O)",
      "c s",
      "CC (C)",
      "2 C",
      "CC (=O)N",
      "/ C",
      "2 CCC",
      "(C (=O)N",
      "CC 2)",
      "[C@@H] (C)",
      "( O)",
      "B r",
      "cc cc",
      "[C@H] (C)",
      "c( -",
      "N(C (=O)",
      "N (",
      "NC(=O) C",
      "[N +]",
      "n 2",
      "cc 1",
      "C c1ccc(",
      "C c1n",
      "3 CC",
      "# N",
      "O=C (N",
      "[N+] (=O)[O-]",
      "c (=O)",
      "c1cc c(C",
      "(C l",
      "= O",
      "2) c1",
      "C l",
      "(F) (F)",
      "[C@H] (",
      "CC N",
      "( -",
      "o 1",
      "c2 )",
      "[C@@H] (",
      ")C 1",
      "C N",
      "c2 c(",
      "CO c1ccc(",
      "n n",
      "c( N",
      "= N",
      "c1cccc (",
      "c1 )",
      "[C@@H] 1",
      "1 )",
      "S(=O) (=O)N",
      "C c1",
      "2) CC1",
      "(C)C )",
      "F )cc1",
      "(N )",
      "2) C1",
      "[C@ ]",
      "[C@H] 1",
      "c2ccccc2 )",
      "c(C (=O)N",
      "3 +]",
      "[NH 3+]",
      "[C@@ ]",
      "CO c1cc",
      "s 1",
      "c(Cl )cc",
      "=C /",
      "[C@H] (C",
      "[C@@H] 1CC",
      "O=C (C",
      "[C@@H] (C",
      "CO C(=O)",
      "c1 C",
      "[C@H] 1CC",
      "O=C (",
      "(F)(F) F)",
      "[C@@H] 2",
      "#N )",
      "c1cc c(Cl",
      "CC CC",
      "1 C(=O)",
      "O CC",
      "C[C@H] (",
      "c3 n",
      "c1n n",
      "c n1",
      ")cc c1",
      "[NH+] (C",
      "c2 c1",
      "C[C@@H] (",
      "H +]",
      "C 1CC",
      "[n H+]",
      ") CC",
      "c4 cccc",
      "[C@H] 2",
      "CCC 1",
      ") c2",
      "2 =O)",
      "n1 cc",
      "c3 c(",
      "[O-] )",
      "n 3",
      "N 1CC",
      "N 2CC",
      "c2c( c1)",
      "= S",
      "S C",
      "3) n",
      "c2ccc( F)cc",
      "c(C) cc",
      "2) n",
      "c1ccc( F)cc1",
      "c1 cn",
      "(C) (C)C",
      "(CC (=O)N",
      "c3cc c(",
      "3 )C",
      "c o",
      "C c1ccccc1",
      "[C@@H] 1CCC",
      "n cc",
      "OC )",
      "cs 1",
      "c( F)",
      "c1cccc (C",
      "[C@@H] 1C",
      "/ N",
      "3 )cc",
      "/C (",
      "C [NH+]",
      "c2 cn",
      "=C (",
      "2) n1",
      "C S",
      "c1 2",
      "(N) =O)",
      "O 1",
      "c4cccc c4",
      "c1cc (",
      "3 C",
      ")N 1CC",
      "[C@H] 1CCC",
      "c2ccccc2 1",
      "c(C) c1",
      "[C@@H] 2CC",
      "(C) C(=O)",
      "[C@H] (C)C",
      "c2cc (",
      "CC [NH+]",
      "CCO C(=O)",
      "/C =C/",
      "c1ccc(Cl )cc1",
      "(=O) =O)",
      "CC(C) (C)",
      "c1ccccc1 )",
      "[C@H] 2CC",
      "N 2",
      "3 CCC",
      "c [nH]",
      "Br )",
      "N #",
      "NC(=O) C(=O)N",
      "[C@H] 1C",
      "n (C)",
      "C )",
      "S (C)",
      "c2cc c(Cl)cc",
      "= CC",
      "[C@@H] (C)C",
      "c1cc c2c(c1)",
      "(CC )",
      "C 2CC",
      "CO c1ccc(C",
      "CO c1ccccc1",
      "[NH+] (C)C",
      "C[C@H] 1",
      "c2n n",
      "(Cl )",
      "[C@@H] 2C",
      "Cc1cc (",
      "C(=O)N 1CC",
      "(C) CC",
      "c4 cc",
      "c1ccc( -",
      "(C) cc",
      "N C",
      "O C(=O)",
      "O =",
      "C[C@@H] 1",
      "C n1",
      "c( NC(=O)",
      "c3 )",
      "c(C) n",
      "N(C (=O)N",
      "cn c2",
      "3) CC2)",
      "c2n cc",
      "[NH3+] )",
      "[C@] 1",
      "c( S",
      "CC (=O)",
      "[C@H] (O)",
      "c(Cl )",
      "C c1cccc",
      "O CO",
      "N 1",
      "CC1 )",
      ")cc c2",
      "[C@@] 1",
      "cn c1",
      "[ S",
      ")C 1CC",
      "S(C) (=O)=O)",
      "c2cc c(C",
      "4 )",
      "c1n cc",
      "( =S",
      "CC n1",
      "(C #N)",
      "[C@H] 2C",
      "c1cc n",
      "[NH2+] C",
      "c3ccccc3 )",
      "c( OC",
      "[C@@H] 2CCC",
      "n2 cc",
      "3CC CC",
      "Cl )",
      "CC C(=O)N",
      "[NH+] 2CC",
      "c o1",
      "Cc1cc c(C",
      "[NH+] 1CC",
      "[N+](=O)[O-] )",
      "n c1",
      "N 1C(=O)",
      "O CCO",
      "CC (C)C",
      "(C) =O)",
      "(C (=O)",
      "[C@H] 2CCC",
      "(Cl )c1",
      "[C@@H] (O)",
      "n (-",
      "c2cccc (",
      "c2cc cs",
      "c2cc c3c(",
      "(C) (C)",
      "c(=O) [nH]",
      "@ ]",
      ")cc 2",
      "3 )cc1",
      "(=O)[O-] )",
      "C(=O) [O-]",
      "C NC(=O)",
      "C[C@@H] (C)",
      "CC 2)cc1",
      "=C \\",
      "C[C@H] (C)",
      "O=C 1",
      "=N /",
      "c2 C",
      "O CC1",
      "=C 2",
      "c2 s",
      "c2ccc3c( c2)",
      "c3ccc( F)cc",
      "n1 )",
      "CC [NH2+]",
      "C[C@H] 1C",
      "c( F)cc",
      "c1cccc 2",
      "c(F) c1",
      "c2cc co"
    ]
  }
}